/*********************************************************************************************************************
 * @file:        App_Export.h
 * @author:      gushengchi
 * @version:     V01.00
 * @date:        2021-08-31
 * @Description: 扩展口端口采集功能数据
 * @ChangeList:  01. 初版
**********************************************************************************************************************/
  
#ifndef  _APP_EXPORT_H
#define  _APP_EXPORT_H

/*--------------------------------------------------文件包含---------------------------------------------------------*/
#include <stdint.h>
#include <stdbool.h>

/*--------------------------------------------------宏定义-----------------------------------------------------------*/
#define MAX_PIN_NUM      4
 
/*--------------------------------------------------枚举声明---------------------------------------------------------*/
typedef enum
{
    E_PIN_FINGER_IRQ = 0,        //指纹检测引脚
	E_PIN_ALARM_IRQ,	         //防撬检测引脚
    E_PIN_SENSE_IRQ,             //感应检测引脚
	E_PIN_TOUCH_IRQ,	         //触摸按键检测引脚
	
}PIN_TYPE_E;
 
/*--------------------------------------------------常量声明---------------------------------------------------------*/


/*--------------------------------------------------变量声明---------------------------------------------------------*/             
 
 
/*--------------------------------------------------函数声明---------------------------------------------------------*/
void App_Export_FileInit( void ); 
void App_Export_WakeupInit( void );
void App_Export_SleepInit( void );
void App_Export_Tim10Ms( void );
void App_Export_ScanPortThread( void );
bool App_Export_GetPinState( PIN_TYPE_E type );
bool App_Export_GetAlrmWarmState( void );
void App_Export_SetAlrmWarmEn( bool cmd );
bool App_Export_GetAlrmWarmEnSts( void );

#endif



/*-------------------------------------------------THE FILE END-----------------------------------------------------*/
 

