/*********************************************************************************************************************
 * @file:        App_Input.h
 * @author:      lixiqun
 * @version:     V01.00
 * @date:        2022-04-14
 * @Description: 输入口端口采集功能数据
 * @ChangeList:  01. 初版
**********************************************************************************************************************/
  
#ifndef  _APP_INPUT_H
#define  _APP_INPUT_H

/*--------------------------------------------------文件包含---------------------------------------------------------*/
#include <stdint.h>
#include <stdbool.h>

/*--------------------------------------------------枚举声明---------------------------------------------------------*/
typedef enum
{
    E_INPUT_FINGER_IRQ = 0,        //指纹检测引脚
	E_INPUT_ALARM_IRQ,	         //防撬检测引脚
    E_INPUT_SENSE_IRQ,             //感应检测引脚
	E_INPUT_TOUCH_IRQ,	         //触摸按键检测引脚
	E_INPUT_CAMERA_IRQ,		//猫眼中断检测引脚
	E_INPUT_RTC_IRQ,		//RTC中断检测引脚
	E_INPUT_OPEN_KEY,		//开门键
    E_INPUT_CLOSE_KEY,	 	//关门键
    E_INPUT_LEFT_HANDLE,     //把手左开
    E_INPUT_MIDDLE_HANDLE,   //把手中 
    E_INPUT_RIGHT_HANDLE,    //把手右开	
    E_INPUT_REGISTER_KEY,    //注册键	
    E_INPUT_ADJUST_LEVEL     //调试端口状态用
	
}PIN_INPUT_TYPE_E;

/*--------------------------------------------------常量声明---------------------------------------------------------*/


/*--------------------------------------------------变量声明---------------------------------------------------------*/             
 
 
/*--------------------------------------------------函数声明---------------------------------------------------------*/
bool App_Input_GetPinState( PIN_INPUT_TYPE_E type );
















#endif

/*-------------------------------------------------THE FILE END-----------------------------------------------------*/